Revit 2026 API

# CheckerCheckerSoften Property

---

The property labeled "Soften" from the "Checker" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string CheckerSoften { get; }
```
```vb
Public Shared ReadOnly Property CheckerSoften As String
	Get
```
```cpp
public:
static property String^ CheckerSoften {
	String^ get ();
}
```
```fsharp
static member CheckerSoften : string with get
```

#### Property Value

String

This property is of type "AssetPropertyDouble" within the range of "0, 5".

#### Reference

Checker Class

Autodesk.Revit.DB.Visual Namespace